<details>
<summary>Execution result of "plan --all --no-color" in "./live"</summary>

```terraform
04:41:47.694 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./membership

Group 2
- Module ./repository

Group 3
- Module ./organization


04:41:48.173 STDOUT [membership] tofu: OpenTofu used the selected providers to generate the following execution
04:41:48.174 STDOUT [membership] tofu: plan. Resource actions are indicated with the following symbols:
04:41:48.174 STDOUT [membership] tofu:   + create
04:41:48.174 STDOUT [membership] tofu: OpenTofu will perform the following actions:
04:41:48.174 STDOUT [membership] tofu:   # github_membership.all["reinhud"] will be created
04:41:48.174 STDOUT [membership] tofu:   + resource "github_membership" "all" {
04:41:48.174 STDOUT [membership] tofu:       + downgrade_on_destroy = false
04:41:48.174 STDOUT [membership] tofu:       + etag                 = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + id                   = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + role                 = "admin"
04:41:48.174 STDOUT [membership] tofu:       + username             = "reinhud"
04:41:48.174 STDOUT [membership] tofu:     }
04:41:48.174 STDOUT [membership] tofu:   # github_team.all["admin"] will be created
04:41:48.174 STDOUT [membership] tofu:   + resource "github_team" "all" {
04:41:48.174 STDOUT [membership] tofu:       + create_default_maintainer = false
04:41:48.174 STDOUT [membership] tofu:       + description               = "Organization wide access, manages day to day organization management"
04:41:48.174 STDOUT [membership] tofu:       + etag                      = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + id                        = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + members_count             = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + name                      = "admin"
04:41:48.174 STDOUT [membership] tofu:       + node_id                   = (known after apply)
04:41:48.174 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + privacy                   = "closed"
04:41:48.175 STDOUT [membership] tofu:       + slug                      = (known after apply)
04:41:48.175 STDOUT [membership] tofu:     }
04:41:48.175 STDOUT [membership] tofu:   # github_team.all["ai"] will be created
04:41:48.175 STDOUT [membership] tofu:   + resource "github_team" "all" {
04:41:48.175 STDOUT [membership] tofu:       + create_default_maintainer = false
04:41:48.175 STDOUT [membership] tofu:       + description               = "AI/ML engineering team"
04:41:48.175 STDOUT [membership] tofu:       + etag                      = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + id                        = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + members_count             = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + name                      = "ai"
04:41:48.175 STDOUT [membership] tofu:       + node_id                   = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
04:41:48.175 STDOUT [membership] tofu:       + privacy                   = "closed"
04:41:48.175 STDOUT [membership] tofu:       + slug                      = (known after apply)
04:41:48.175 STDOUT [membership] tofu:     }
04:41:48.175 STDOUT [membership] tofu:   # github_team.all["app"] will be created
04:41:48.175 STDOUT [membership] tofu:   + resource "github_team" "all" {
04:41:48.175 STDOUT [membership] tofu:       + create_default_maintainer = false
04:41:48.175 STDOUT [membership] tofu:       + description               = "Application development team"
04:41:48.176 STDOUT [membership] tofu:       + etag                      = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + id                        = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + members_count             = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + name                      = "app"
04:41:48.176 STDOUT [membership] tofu:       + node_id                   = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + privacy                   = "closed"
04:41:48.176 STDOUT [membership] tofu:       + slug                      = (known after apply)
04:41:48.176 STDOUT [membership] tofu:     }
04:41:48.176 STDOUT [membership] tofu:   # github_team.all["platform"] will be created
04:41:48.176 STDOUT [membership] tofu:   + resource "github_team" "all" {
04:41:48.176 STDOUT [membership] tofu:       + create_default_maintainer = false
04:41:48.176 STDOUT [membership] tofu:       + description               = "Platform engineering and infrastructure team"
04:41:48.176 STDOUT [membership] tofu:       + etag                      = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + id                        = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + members_count             = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + name                      = "platform"
04:41:48.176 STDOUT [membership] tofu:       + node_id                   = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
04:41:48.176 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + privacy                   = "closed"
04:41:48.177 STDOUT [membership] tofu:       + slug                      = (known after apply)
04:41:48.177 STDOUT [membership] tofu:     }
04:41:48.177 STDOUT [membership] tofu:   # github_team_membership.members["admin:reinhud"] will be created
04:41:48.177 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
04:41:48.177 STDOUT [membership] tofu:       + etag     = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + id       = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + role     = "maintainer"
04:41:48.177 STDOUT [membership] tofu:       + team_id  = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + username = "reinhud"
04:41:48.177 STDOUT [membership] tofu:     }
04:41:48.177 STDOUT [membership] tofu:   # github_team_membership.members["ai:reinhud"] will be created
04:41:48.177 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
04:41:48.177 STDOUT [membership] tofu:       + etag     = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + id       = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + role     = "maintainer"
04:41:48.177 STDOUT [membership] tofu:       + team_id  = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + username = "reinhud"
04:41:48.177 STDOUT [membership] tofu:     }
04:41:48.177 STDOUT [membership] tofu:   # github_team_membership.members["app:reinhud"] will be created
04:41:48.177 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
04:41:48.177 STDOUT [membership] tofu:       + etag     = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + id       = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + role     = "maintainer"
04:41:48.177 STDOUT [membership] tofu:       + team_id  = (known after apply)
04:41:48.177 STDOUT [membership] tofu:       + username = "reinhud"
04:41:48.177 STDOUT [membership] tofu:     }
04:41:48.177 STDOUT [membership] tofu:   # github_team_membership.members["platform:reinhud"] will be created
04:41:48.177 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
04:41:48.178 STDOUT [membership] tofu:       + etag     = (known after apply)
04:41:48.178 STDOUT [membership] tofu:       + id       = (known after apply)
04:41:48.178 STDOUT [membership] tofu:       + role     = "maintainer"
04:41:48.178 STDOUT [membership] tofu:       + team_id  = (known after apply)
04:41:48.178 STDOUT [membership] tofu:       + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:     }
04:41:48.178 STDOUT [membership] tofu: Plan: 9 to add, 0 to change, 0 to destroy.
04:41:48.178 STDOUT [membership] tofu: Changes to Outputs:
04:41:48.178 STDOUT [membership] tofu:   + organization_members = {
04:41:48.178 STDOUT [membership] tofu:       + reinhud = {
04:41:48.178 STDOUT [membership] tofu:           + role     = "admin"
04:41:48.178 STDOUT [membership] tofu:           + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:         }
04:41:48.178 STDOUT [membership] tofu:     }
04:41:48.178 STDOUT [membership] tofu:   + team_memberships     = {
04:41:48.178 STDOUT [membership] tofu:       + "admin:reinhud"    = {
04:41:48.178 STDOUT [membership] tofu:           + role     = "maintainer"
04:41:48.178 STDOUT [membership] tofu:           + team_id  = (known after apply)
04:41:48.178 STDOUT [membership] tofu:           + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:         }
04:41:48.178 STDOUT [membership] tofu:       + "ai:reinhud"       = {
04:41:48.178 STDOUT [membership] tofu:           + role     = "maintainer"
04:41:48.178 STDOUT [membership] tofu:           + team_id  = (known after apply)
04:41:48.178 STDOUT [membership] tofu:           + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:         }
04:41:48.178 STDOUT [membership] tofu:       + "app:reinhud"      = {
04:41:48.178 STDOUT [membership] tofu:           + role     = "maintainer"
04:41:48.178 STDOUT [membership] tofu:           + team_id  = (known after apply)
04:41:48.178 STDOUT [membership] tofu:           + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:         }
04:41:48.178 STDOUT [membership] tofu:       + "platform:reinhud" = {
04:41:48.178 STDOUT [membership] tofu:           + role     = "maintainer"
04:41:48.178 STDOUT [membership] tofu:           + team_id  = (known after apply)
04:41:48.178 STDOUT [membership] tofu:           + username = "reinhud"
04:41:48.178 STDOUT [membership] tofu:         }
04:41:48.178 STDOUT [membership] tofu:     }
04:41:48.178 STDOUT [membership] tofu:   + teams                = {
04:41:48.178 STDOUT [membership] tofu:       + admin    = {
04:41:48.178 STDOUT [membership] tofu:           + description   = "Organization wide access, manages day to day organization management"
04:41:48.179 STDOUT [membership] tofu:           + id            = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + members_count = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + name          = "admin"
04:41:48.179 STDOUT [membership] tofu:           + node_id       = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + privacy       = "closed"
04:41:48.179 STDOUT [membership] tofu:           + slug          = (known after apply)
04:41:48.179 STDOUT [membership] tofu:         }
04:41:48.179 STDOUT [membership] tofu:       + ai       = {
04:41:48.179 STDOUT [membership] tofu:           + description   = "AI/ML engineering team"
04:41:48.179 STDOUT [membership] tofu:           + id            = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + members_count = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + name          = "ai"
04:41:48.179 STDOUT [membership] tofu:           + node_id       = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + privacy       = "closed"
04:41:48.179 STDOUT [membership] tofu:           + slug          = (known after apply)
04:41:48.179 STDOUT [membership] tofu:         }
04:41:48.179 STDOUT [membership] tofu:       + app      = {
04:41:48.179 STDOUT [membership] tofu:           + description   = "Application development team"
04:41:48.179 STDOUT [membership] tofu:           + id            = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + members_count = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + name          = "app"
04:41:48.179 STDOUT [membership] tofu:           + node_id       = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + privacy       = "closed"
04:41:48.179 STDOUT [membership] tofu:           + slug          = (known after apply)
04:41:48.179 STDOUT [membership] tofu:         }
04:41:48.179 STDOUT [membership] tofu:       + platform = {
04:41:48.179 STDOUT [membership] tofu:           + description   = "Platform engineering and infrastructure team"
04:41:48.179 STDOUT [membership] tofu:           + id            = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + members_count = (known after apply)
04:41:48.179 STDOUT [membership] tofu:           + name          = "platform"
04:41:48.180 STDOUT [membership] tofu:           + node_id       = (known after apply)
04:41:48.180 STDOUT [membership] tofu:           + privacy       = "closed"
04:41:48.180 STDOUT [membership] tofu:           + slug          = (known after apply)
04:41:48.180 STDOUT [membership] tofu:         }
04:41:48.180 STDOUT [membership] tofu:     }
04:41:48.235 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
04:41:48.792 STDOUT [repository] tofu: OpenTofu used the selected providers to generate the following execution
04:41:48.793 STDOUT [repository] tofu: plan. Resource actions are indicated with the following symbols:
04:41:48.793 STDOUT [repository] tofu:   + create
04:41:48.793 STDOUT [repository] tofu: OpenTofu will perform the following actions:
04:41:48.793 STDOUT [repository] tofu:   # github_issue_label.all[".github:bug"] will be created
04:41:48.793 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.793 STDOUT [repository] tofu:       + color       = "d73a4a"
04:41:48.793 STDOUT [repository] tofu:       + description = "Something isn't working"
04:41:48.793 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.793 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.793 STDOUT [repository] tofu:       + name        = "bug"
04:41:48.793 STDOUT [repository] tofu:       + repository  = ".github"
04:41:48.793 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.793 STDOUT [repository] tofu:     }
04:41:48.793 STDOUT [repository] tofu:   # github_issue_label.all[".github:stuff"] will be created
04:41:48.793 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.793 STDOUT [repository] tofu:       + color       = "a2eeef"
04:41:48.793 STDOUT [repository] tofu:       + description = "Stuff"
04:41:48.793 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.793 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.793 STDOUT [repository] tofu:       + name        = "stuff"
04:41:48.793 STDOUT [repository] tofu:       + repository  = ".github"
04:41:48.793 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.793 STDOUT [repository] tofu:     }
04:41:48.793 STDOUT [repository] tofu:   # github_issue_label.all["github-management:bug"] will be created
04:41:48.793 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.794 STDOUT [repository] tofu:       + color       = "d73a4a"
04:41:48.794 STDOUT [repository] tofu:       + description = "Something isn't working"
04:41:48.794 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + name        = "bug"
04:41:48.794 STDOUT [repository] tofu:       + repository  = "github-management"
04:41:48.794 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.794 STDOUT [repository] tofu:     }
04:41:48.794 STDOUT [repository] tofu:   # github_issue_label.all["github-management:stuff"] will be created
04:41:48.794 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.794 STDOUT [repository] tofu:       + color       = "a2eeef"
04:41:48.794 STDOUT [repository] tofu:       + description = "Stuff"
04:41:48.794 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + name        = "stuff"
04:41:48.794 STDOUT [repository] tofu:       + repository  = "github-management"
04:41:48.794 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.794 STDOUT [repository] tofu:     }
04:41:48.794 STDOUT [repository] tofu:   # github_issue_label.all["gitops:bug"] will be created
04:41:48.794 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.794 STDOUT [repository] tofu:       + color       = "d73a4a"
04:41:48.794 STDOUT [repository] tofu:       + description = "Something isn't working"
04:41:48.794 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.794 STDOUT [repository] tofu:       + name        = "bug"
04:41:48.794 STDOUT [repository] tofu:       + repository  = "gitops"
04:41:48.794 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.794 STDOUT [repository] tofu:     }
04:41:48.794 STDOUT [repository] tofu:   # github_issue_label.all["gitops:stuff"] will be created
04:41:48.795 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.795 STDOUT [repository] tofu:       + color       = "a2eeef"
04:41:48.795 STDOUT [repository] tofu:       + description = "Stuff"
04:41:48.795 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + name        = "stuff"
04:41:48.795 STDOUT [repository] tofu:       + repository  = "gitops"
04:41:48.795 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.795 STDOUT [repository] tofu:     }
04:41:48.795 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:bug"] will be created
04:41:48.795 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.795 STDOUT [repository] tofu:       + color       = "d73a4a"
04:41:48.795 STDOUT [repository] tofu:       + description = "Something isn't working"
04:41:48.795 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + name        = "bug"
04:41:48.795 STDOUT [repository] tofu:       + repository  = "infra-live"
04:41:48.795 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.795 STDOUT [repository] tofu:     }
04:41:48.795 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:stuff"] will be created
04:41:48.795 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.795 STDOUT [repository] tofu:       + color       = "a2eeef"
04:41:48.795 STDOUT [repository] tofu:       + description = "Stuff"
04:41:48.795 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.795 STDOUT [repository] tofu:       + name        = "stuff"
04:41:48.795 STDOUT [repository] tofu:       + repository  = "infra-live"
04:41:48.795 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.795 STDOUT [repository] tofu:     }
04:41:48.796 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:bug"] will be created
04:41:48.796 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.796 STDOUT [repository] tofu:       + color       = "d73a4a"
04:41:48.796 STDOUT [repository] tofu:       + description = "Something isn't working"
04:41:48.796 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.796 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.796 STDOUT [repository] tofu:       + name        = "bug"
04:41:48.796 STDOUT [repository] tofu:       + repository  = "infra-modules"
04:41:48.796 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.796 STDOUT [repository] tofu:     }
04:41:48.796 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:stuff"] will be created
04:41:48.796 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
04:41:48.796 STDOUT [repository] tofu:       + color       = "a2eeef"
04:41:48.796 STDOUT [repository] tofu:       + description = "Stuff"
04:41:48.796 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.796 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.796 STDOUT [repository] tofu:       + name        = "stuff"
04:41:48.796 STDOUT [repository] tofu:       + repository  = "infra-modules"
04:41:48.796 STDOUT [repository] tofu:       + url         = (known after apply)
04:41:48.796 STDOUT [repository] tofu:     }
04:41:48.796 STDOUT [repository] tofu:   # github_repository.all[".github"] will be created
04:41:48.796 STDOUT [repository] tofu:   + resource "github_repository" "all" {
04:41:48.796 STDOUT [repository] tofu:       + allow_auto_merge            = true
04:41:48.796 STDOUT [repository] tofu:       + allow_merge_commit          = true
04:41:48.796 STDOUT [repository] tofu:       + allow_rebase_merge          = true
04:41:48.796 STDOUT [repository] tofu:       + allow_squash_merge          = true
04:41:48.796 STDOUT [repository] tofu:       + allow_update_branch         = true
04:41:48.796 STDOUT [repository] tofu:       + archive_on_destroy          = false
04:41:48.797 STDOUT [repository] tofu:       + archived                    = false
04:41:48.797 STDOUT [repository] tofu:       + auto_init                   = true
04:41:48.797 STDOUT [repository] tofu:       + default_branch              = (known after apply)
04:41:48.797 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
04:41:48.797 STDOUT [repository] tofu:       + description                 = "Organization-wide GitHub configurations, workflows, and community templates"
04:41:48.797 STDOUT [repository] tofu:       + etag                        = (known after apply)
04:41:48.797 STDOUT [repository] tofu:       + full_name                   = (known after apply)
04:41:48.797 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
04:41:48.797 STDOUT [repository] tofu:       + has_discussions             = true
04:41:48.797 STDOUT [repository] tofu:       + has_downloads               = false
04:41:48.797 STDOUT [repository] tofu:       + has_issues                  = true
04:41:48.797 STDOUT [repository] tofu:       + has_projects                = false
04:41:48.797 STDOUT [repository] tofu:       + has_wiki                    = true
04:41:48.797 STDOUT [repository] tofu:       + html_url                    = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + id                          = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + license_template            = "mit"
04:41:48.798 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
04:41:48.798 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
04:41:48.798 STDOUT [repository] tofu:       + name                        = ".github"
04:41:48.798 STDOUT [repository] tofu:       + node_id                     = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + primary_language            = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + private                     = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
04:41:48.798 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
04:41:48.798 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
04:41:48.798 STDOUT [repository] tofu:       + topics                      = [
04:41:48.798 STDOUT [repository] tofu:           + "automation",
04:41:48.798 STDOUT [repository] tofu:           + "community",
04:41:48.798 STDOUT [repository] tofu:           + "github",
04:41:48.798 STDOUT [repository] tofu:           + "templates",
04:41:48.798 STDOUT [repository] tofu:           + "workflows",
04:41:48.798 STDOUT [repository] tofu:         ]
04:41:48.798 STDOUT [repository] tofu:       + visibility                  = "public"
04:41:48.798 STDOUT [repository] tofu:       + vulnerability_alerts        = true
04:41:48.798 STDOUT [repository] tofu:       + web_commit_signoff_required = false
04:41:48.798 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
04:41:48.798 STDOUT [repository] tofu:     }
04:41:48.798 STDOUT [repository] tofu:   # github_repository.all["github-management"] will be created
04:41:48.799 STDOUT [repository] tofu:   + resource "github_repository" "all" {
04:41:48.799 STDOUT [repository] tofu:       + allow_auto_merge            = false
04:41:48.799 STDOUT [repository] tofu:       + allow_merge_commit          = true
04:41:48.799 STDOUT [repository] tofu:       + allow_rebase_merge          = true
04:41:48.799 STDOUT [repository] tofu:       + allow_squash_merge          = true
04:41:48.799 STDOUT [repository] tofu:       + allow_update_branch         = true
04:41:48.799 STDOUT [repository] tofu:       + archive_on_destroy          = false
04:41:48.799 STDOUT [repository] tofu:       + archived                    = false
04:41:48.799 STDOUT [repository] tofu:       + auto_init                   = true
04:41:48.799 STDOUT [repository] tofu:       + default_branch              = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
04:41:48.799 STDOUT [repository] tofu:       + description                 = "Infrastructure as Code for GitHub organization, repositories, and security management"
04:41:48.799 STDOUT [repository] tofu:       + etag                        = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + full_name                   = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
04:41:48.799 STDOUT [repository] tofu:       + has_discussions             = false
04:41:48.799 STDOUT [repository] tofu:       + has_downloads               = false
04:41:48.799 STDOUT [repository] tofu:       + has_issues                  = true
04:41:48.799 STDOUT [repository] tofu:       + has_projects                = false
04:41:48.799 STDOUT [repository] tofu:       + has_wiki                    = false
04:41:48.799 STDOUT [repository] tofu:       + html_url                    = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
04:41:48.799 STDOUT [repository] tofu:       + id                          = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
04:41:48.800 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
04:41:48.800 STDOUT [repository] tofu:       + name                        = "github-management"
04:41:48.800 STDOUT [repository] tofu:       + node_id                     = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + primary_language            = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + private                     = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
04:41:48.800 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
04:41:48.800 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
04:41:48.800 STDOUT [repository] tofu:       + topics                      = [
04:41:48.800 STDOUT [repository] tofu:           + "automation",
04:41:48.800 STDOUT [repository] tofu:           + "github",
04:41:48.800 STDOUT [repository] tofu:           + "infrastructure",
04:41:48.800 STDOUT [repository] tofu:           + "security",
04:41:48.800 STDOUT [repository] tofu:           + "terraform",
04:41:48.800 STDOUT [repository] tofu:         ]
04:41:48.800 STDOUT [repository] tofu:       + visibility                  = "public"
04:41:48.800 STDOUT [repository] tofu:       + vulnerability_alerts        = true
04:41:48.800 STDOUT [repository] tofu:       + web_commit_signoff_required = false
04:41:48.800 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
04:41:48.800 STDOUT [repository] tofu:     }
04:41:48.800 STDOUT [repository] tofu:   # github_repository.all["gitops"] will be created
04:41:48.800 STDOUT [repository] tofu:   + resource "github_repository" "all" {
04:41:48.800 STDOUT [repository] tofu:       + allow_auto_merge            = false
04:41:48.800 STDOUT [repository] tofu:       + allow_merge_commit          = true
04:41:48.800 STDOUT [repository] tofu:       + allow_rebase_merge          = true
04:41:48.801 STDOUT [repository] tofu:       + allow_squash_merge          = true
04:41:48.801 STDOUT [repository] tofu:       + allow_update_branch         = true
04:41:48.801 STDOUT [repository] tofu:       + archive_on_destroy          = false
04:41:48.801 STDOUT [repository] tofu:       + archived                    = false
04:41:48.801 STDOUT [repository] tofu:       + auto_init                   = true
04:41:48.801 STDOUT [repository] tofu:       + default_branch              = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
04:41:48.801 STDOUT [repository] tofu:       + description                 = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
04:41:48.801 STDOUT [repository] tofu:       + etag                        = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + full_name                   = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
04:41:48.801 STDOUT [repository] tofu:       + has_discussions             = false
04:41:48.801 STDOUT [repository] tofu:       + has_downloads               = false
04:41:48.801 STDOUT [repository] tofu:       + has_issues                  = true
04:41:48.801 STDOUT [repository] tofu:       + has_projects                = false
04:41:48.801 STDOUT [repository] tofu:       + has_wiki                    = false
04:41:48.801 STDOUT [repository] tofu:       + html_url                    = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + id                          = (known after apply)
04:41:48.801 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
04:41:48.801 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
04:41:48.801 STDOUT [repository] tofu:       + name                        = "gitops"
04:41:48.801 STDOUT [repository] tofu:       + node_id                     = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + primary_language            = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + private                     = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
04:41:48.802 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
04:41:48.802 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
04:41:48.802 STDOUT [repository] tofu:       + topics                      = [
04:41:48.802 STDOUT [repository] tofu:           + "argocd",
04:41:48.802 STDOUT [repository] tofu:           + "deployments",
04:41:48.802 STDOUT [repository] tofu:           + "gitops",
04:41:48.802 STDOUT [repository] tofu:           + "helm",
04:41:48.802 STDOUT [repository] tofu:           + "kubernetes",
04:41:48.802 STDOUT [repository] tofu:         ]
04:41:48.802 STDOUT [repository] tofu:       + visibility                  = "public"
04:41:48.802 STDOUT [repository] tofu:       + vulnerability_alerts        = true
04:41:48.802 STDOUT [repository] tofu:       + web_commit_signoff_required = false
04:41:48.802 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
04:41:48.802 STDOUT [repository] tofu:     }
04:41:48.802 STDOUT [repository] tofu:   # github_repository.all["infra-live"] will be created
04:41:48.802 STDOUT [repository] tofu:   + resource "github_repository" "all" {
04:41:48.802 STDOUT [repository] tofu:       + allow_auto_merge            = false
04:41:48.802 STDOUT [repository] tofu:       + allow_merge_commit          = true
04:41:48.802 STDOUT [repository] tofu:       + allow_rebase_merge          = true
04:41:48.802 STDOUT [repository] tofu:       + allow_squash_merge          = true
04:41:48.802 STDOUT [repository] tofu:       + allow_update_branch         = true
04:41:48.802 STDOUT [repository] tofu:       + archive_on_destroy          = false
04:41:48.803 STDOUT [repository] tofu:       + archived                    = false
04:41:48.803 STDOUT [repository] tofu:       + auto_init                   = true
04:41:48.803 STDOUT [repository] tofu:       + default_branch              = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
04:41:48.803 STDOUT [repository] tofu:       + description                 = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
04:41:48.803 STDOUT [repository] tofu:       + etag                        = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + full_name                   = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
04:41:48.803 STDOUT [repository] tofu:       + has_discussions             = false
04:41:48.803 STDOUT [repository] tofu:       + has_downloads               = false
04:41:48.803 STDOUT [repository] tofu:       + has_issues                  = true
04:41:48.803 STDOUT [repository] tofu:       + has_projects                = false
04:41:48.803 STDOUT [repository] tofu:       + has_wiki                    = false
04:41:48.803 STDOUT [repository] tofu:       + html_url                    = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + id                          = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
04:41:48.803 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
04:41:48.803 STDOUT [repository] tofu:       + name                        = "infra-live"
04:41:48.803 STDOUT [repository] tofu:       + node_id                     = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + primary_language            = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + private                     = (known after apply)
04:41:48.803 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
04:41:48.804 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
04:41:48.804 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
04:41:48.804 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
04:41:48.804 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
04:41:48.804 STDOUT [repository] tofu:       + topics                      = [
04:41:48.804 STDOUT [repository] tofu:           + "environments",
04:41:48.804 STDOUT [repository] tofu:           + "infrastructure",
04:41:48.804 STDOUT [repository] tofu:           + "production",
04:41:48.804 STDOUT [repository] tofu:           + "terraform",
04:41:48.804 STDOUT [repository] tofu:           + "terragrunt",
04:41:48.804 STDOUT [repository] tofu:         ]
04:41:48.804 STDOUT [repository] tofu:       + visibility                  = "public"
04:41:48.804 STDOUT [repository] tofu:       + vulnerability_alerts        = true
04:41:48.804 STDOUT [repository] tofu:       + web_commit_signoff_required = false
04:41:48.804 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
04:41:48.804 STDOUT [repository] tofu:     }
04:41:48.804 STDOUT [repository] tofu:   # github_repository.all["infra-modules"] will be created
04:41:48.804 STDOUT [repository] tofu:   + resource "github_repository" "all" {
04:41:48.804 STDOUT [repository] tofu:       + allow_auto_merge            = false
04:41:48.804 STDOUT [repository] tofu:       + allow_merge_commit          = true
04:41:48.804 STDOUT [repository] tofu:       + allow_rebase_merge          = true
04:41:48.804 STDOUT [repository] tofu:       + allow_squash_merge          = true
04:41:48.804 STDOUT [repository] tofu:       + allow_update_branch         = true
04:41:48.804 STDOUT [repository] tofu:       + archive_on_destroy          = false
04:41:48.804 STDOUT [repository] tofu:       + archived                    = false
04:41:48.804 STDOUT [repository] tofu:       + auto_init                   = true
04:41:48.804 STDOUT [repository] tofu:       + default_branch              = (known after apply)
04:41:48.804 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
04:41:48.805 STDOUT [repository] tofu:       + description                 = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
04:41:48.805 STDOUT [repository] tofu:       + etag                        = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + full_name                   = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
04:41:48.805 STDOUT [repository] tofu:       + has_discussions             = false
04:41:48.805 STDOUT [repository] tofu:       + has_downloads               = false
04:41:48.805 STDOUT [repository] tofu:       + has_issues                  = true
04:41:48.805 STDOUT [repository] tofu:       + has_projects                = false
04:41:48.805 STDOUT [repository] tofu:       + has_wiki                    = false
04:41:48.805 STDOUT [repository] tofu:       + html_url                    = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + id                          = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
04:41:48.805 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
04:41:48.805 STDOUT [repository] tofu:       + name                        = "infra-modules"
04:41:48.805 STDOUT [repository] tofu:       + node_id                     = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + primary_language            = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + private                     = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
04:41:48.805 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
04:41:48.805 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
04:41:48.805 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + topics                      = [
04:41:48.806 STDOUT [repository] tofu:           + "cloud",
04:41:48.806 STDOUT [repository] tofu:           + "infrastructure",
04:41:48.806 STDOUT [repository] tofu:           + "kubernetes",
04:41:48.806 STDOUT [repository] tofu:           + "modules",
04:41:48.806 STDOUT [repository] tofu:           + "terraform",
04:41:48.806 STDOUT [repository] tofu:         ]
04:41:48.806 STDOUT [repository] tofu:       + visibility                  = "public"
04:41:48.806 STDOUT [repository] tofu:       + vulnerability_alerts        = true
04:41:48.806 STDOUT [repository] tofu:       + web_commit_signoff_required = false
04:41:48.806 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
04:41:48.806 STDOUT [repository] tofu:     }
04:41:48.806 STDOUT [repository] tofu:   # github_repository_milestone.all[".github:Phase 1: Milestone 1"] will be created
04:41:48.806 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
04:41:48.806 STDOUT [repository] tofu:       + description = "Milestone 1"
04:41:48.806 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
04:41:48.806 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + number      = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
04:41:48.806 STDOUT [repository] tofu:       + repository  = ".github"
04:41:48.806 STDOUT [repository] tofu:       + state       = "open"
04:41:48.806 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
04:41:48.806 STDOUT [repository] tofu:     }
04:41:48.806 STDOUT [repository] tofu:   # github_repository_milestone.all["github-management:Phase 1: Milestone 1"] will be created
04:41:48.806 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
04:41:48.806 STDOUT [repository] tofu:       + description = "Milestone 1"
04:41:48.806 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
04:41:48.806 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + number      = (known after apply)
04:41:48.806 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
04:41:48.806 STDOUT [repository] tofu:       + repository  = "github-management"
04:41:48.806 STDOUT [repository] tofu:       + state       = "open"
04:41:48.806 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
04:41:48.806 STDOUT [repository] tofu:     }
04:41:48.806 STDOUT [repository] tofu:   # github_repository_milestone.all["gitops:Phase 1: Milestone 1"] will be created
04:41:48.807 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
04:41:48.807 STDOUT [repository] tofu:       + description = "Milestone 1"
04:41:48.807 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
04:41:48.807 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + number      = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
04:41:48.807 STDOUT [repository] tofu:       + repository  = "gitops"
04:41:48.807 STDOUT [repository] tofu:       + state       = "open"
04:41:48.807 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
04:41:48.807 STDOUT [repository] tofu:     }
04:41:48.807 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-live:Phase 1: Milestone 1"] will be created
04:41:48.807 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
04:41:48.807 STDOUT [repository] tofu:       + description = "Milestone 1"
04:41:48.807 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
04:41:48.807 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + number      = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
04:41:48.807 STDOUT [repository] tofu:       + repository  = "infra-live"
04:41:48.807 STDOUT [repository] tofu:       + state       = "open"
04:41:48.807 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
04:41:48.807 STDOUT [repository] tofu:     }
04:41:48.807 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-modules:Phase 1: Milestone 1"] will be created
04:41:48.807 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
04:41:48.807 STDOUT [repository] tofu:       + description = "Milestone 1"
04:41:48.807 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
04:41:48.807 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + number      = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
04:41:48.807 STDOUT [repository] tofu:       + repository  = "infra-modules"
04:41:48.807 STDOUT [repository] tofu:       + state       = "open"
04:41:48.807 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
04:41:48.807 STDOUT [repository] tofu:     }
04:41:48.807 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets[".github:public-security"] will be created
04:41:48.807 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
04:41:48.807 STDOUT [repository] tofu:       + enforcement = "active"
04:41:48.807 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
04:41:48.807 STDOUT [repository] tofu:       + node_id     = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + repository  = ".github"
04:41:48.807 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
04:41:48.807 STDOUT [repository] tofu:       + target      = "branch"
04:41:48.807 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.807 STDOUT [repository] tofu:           + actor_id    = 1
04:41:48.807 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
04:41:48.807 STDOUT [repository] tofu:           + bypass_mode = "always"
04:41:48.807 STDOUT [repository] tofu:         }
04:41:48.807 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.807 STDOUT [repository] tofu:           + actor_id    = 5
04:41:48.807 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
04:41:48.807 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
04:41:48.807 STDOUT [repository] tofu:         }
04:41:48.807 STDOUT [repository] tofu:       + conditions {
04:41:48.807 STDOUT [repository] tofu:           + ref_name {
04:41:48.807 STDOUT [repository] tofu:               + exclude = []
04:41:48.807 STDOUT [repository] tofu:               + include = [
04:41:48.808 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
04:41:48.808 STDOUT [repository] tofu:                 ]
04:41:48.808 STDOUT [repository] tofu:             }
04:41:48.808 STDOUT [repository] tofu:         }
04:41:48.808 STDOUT [repository] tofu:       + rules {
04:41:48.808 STDOUT [repository] tofu:           + creation                      = true
04:41:48.808 STDOUT [repository] tofu:           + deletion                      = true
04:41:48.808 STDOUT [repository] tofu:           + non_fast_forward              = true
04:41:48.808 STDOUT [repository] tofu:           + required_linear_history       = true
04:41:48.808 STDOUT [repository] tofu:           + required_signatures           = true
04:41:48.808 STDOUT [repository] tofu:           + update                        = true
04:41:48.808 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
04:41:48.808 STDOUT [repository] tofu:           + branch_name_pattern {
04:41:48.808 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
04:41:48.808 STDOUT [repository] tofu:               + negate   = true
04:41:48.808 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.808 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
04:41:48.808 STDOUT [repository] tofu:             }
04:41:48.808 STDOUT [repository] tofu:           + commit_message_pattern {
04:41:48.808 STDOUT [repository] tofu:               + name     = "Conventional Commits"
04:41:48.808 STDOUT [repository] tofu:               + negate   = false
04:41:48.808 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.808 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
04:41:48.808 STDOUT [repository] tofu:             }
04:41:48.808 STDOUT [repository] tofu:           + merge_queue {
04:41:48.808 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
04:41:48.808 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
04:41:48.808 STDOUT [repository] tofu:               + max_entries_to_build              = 5
04:41:48.808 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
04:41:48.809 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
04:41:48.809 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
04:41:48.809 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
04:41:48.809 STDOUT [repository] tofu:             }
04:41:48.809 STDOUT [repository] tofu:           + pull_request {
04:41:48.809 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
04:41:48.809 STDOUT [repository] tofu:               + require_code_owner_review         = true
04:41:48.809 STDOUT [repository] tofu:               + require_last_push_approval        = true
04:41:48.809 STDOUT [repository] tofu:               + required_approving_review_count   = 2
04:41:48.809 STDOUT [repository] tofu:               + required_review_thread_resolution = true
04:41:48.809 STDOUT [repository] tofu:             }
04:41:48.809 STDOUT [repository] tofu:           + required_code_scanning {
04:41:48.809 STDOUT [repository] tofu:               + required_code_scanning_tool {
04:41:48.809 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
04:41:48.809 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
04:41:48.809 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
04:41:48.809 STDOUT [repository] tofu:                 }
04:41:48.809 STDOUT [repository] tofu:             }
04:41:48.809 STDOUT [repository] tofu:           + required_status_checks {
04:41:48.809 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
04:41:48.809 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
04:41:48.809 STDOUT [repository] tofu:               + required_check {
04:41:48.809 STDOUT [repository] tofu:                   + context        = "Code Quality"
04:41:48.809 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.810 STDOUT [repository] tofu:                 }
04:41:48.810 STDOUT [repository] tofu:               + required_check {
04:41:48.810 STDOUT [repository] tofu:                   + context        = "Security Scan"
04:41:48.810 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.810 STDOUT [repository] tofu:                 }
04:41:48.810 STDOUT [repository] tofu:               + required_check {
04:41:48.810 STDOUT [repository] tofu:                   + context        = "Tests"
04:41:48.810 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.810 STDOUT [repository] tofu:                 }
04:41:48.810 STDOUT [repository] tofu:             }
04:41:48.810 STDOUT [repository] tofu:         }
04:41:48.810 STDOUT [repository] tofu:     }
04:41:48.810 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["github-management:public-security"] will be created
04:41:48.810 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
04:41:48.810 STDOUT [repository] tofu:       + enforcement = "active"
04:41:48.810 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.810 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.810 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
04:41:48.810 STDOUT [repository] tofu:       + node_id     = (known after apply)
04:41:48.810 STDOUT [repository] tofu:       + repository  = "github-management"
04:41:48.810 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
04:41:48.810 STDOUT [repository] tofu:       + target      = "branch"
04:41:48.810 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.810 STDOUT [repository] tofu:           + actor_id    = 1
04:41:48.810 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
04:41:48.810 STDOUT [repository] tofu:           + bypass_mode = "always"
04:41:48.810 STDOUT [repository] tofu:         }
04:41:48.810 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.810 STDOUT [repository] tofu:           + actor_id    = 5
04:41:48.811 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
04:41:48.811 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
04:41:48.811 STDOUT [repository] tofu:         }
04:41:48.811 STDOUT [repository] tofu:       + conditions {
04:41:48.811 STDOUT [repository] tofu:           + ref_name {
04:41:48.811 STDOUT [repository] tofu:               + exclude = []
04:41:48.811 STDOUT [repository] tofu:               + include = [
04:41:48.811 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
04:41:48.811 STDOUT [repository] tofu:                 ]
04:41:48.811 STDOUT [repository] tofu:             }
04:41:48.811 STDOUT [repository] tofu:         }
04:41:48.811 STDOUT [repository] tofu:       + rules {
04:41:48.811 STDOUT [repository] tofu:           + creation                      = true
04:41:48.811 STDOUT [repository] tofu:           + deletion                      = true
04:41:48.811 STDOUT [repository] tofu:           + non_fast_forward              = true
04:41:48.811 STDOUT [repository] tofu:           + required_linear_history       = true
04:41:48.811 STDOUT [repository] tofu:           + required_signatures           = true
04:41:48.811 STDOUT [repository] tofu:           + update                        = true
04:41:48.811 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
04:41:48.811 STDOUT [repository] tofu:           + branch_name_pattern {
04:41:48.811 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
04:41:48.811 STDOUT [repository] tofu:               + negate   = true
04:41:48.811 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.811 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
04:41:48.811 STDOUT [repository] tofu:             }
04:41:48.811 STDOUT [repository] tofu:           + commit_message_pattern {
04:41:48.811 STDOUT [repository] tofu:               + name     = "Conventional Commits"
04:41:48.811 STDOUT [repository] tofu:               + negate   = false
04:41:48.811 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.811 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
04:41:48.812 STDOUT [repository] tofu:             }
04:41:48.812 STDOUT [repository] tofu:           + merge_queue {
04:41:48.812 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
04:41:48.812 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
04:41:48.812 STDOUT [repository] tofu:               + max_entries_to_build              = 5
04:41:48.812 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
04:41:48.812 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
04:41:48.812 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
04:41:48.812 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
04:41:48.812 STDOUT [repository] tofu:             }
04:41:48.812 STDOUT [repository] tofu:           + pull_request {
04:41:48.812 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
04:41:48.812 STDOUT [repository] tofu:               + require_code_owner_review         = true
04:41:48.812 STDOUT [repository] tofu:               + require_last_push_approval        = true
04:41:48.812 STDOUT [repository] tofu:               + required_approving_review_count   = 2
04:41:48.812 STDOUT [repository] tofu:               + required_review_thread_resolution = true
04:41:48.812 STDOUT [repository] tofu:             }
04:41:48.812 STDOUT [repository] tofu:           + required_code_scanning {
04:41:48.812 STDOUT [repository] tofu:               + required_code_scanning_tool {
04:41:48.812 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
04:41:48.812 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
04:41:48.812 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
04:41:48.813 STDOUT [repository] tofu:                 }
04:41:48.813 STDOUT [repository] tofu:             }
04:41:48.813 STDOUT [repository] tofu:           + required_status_checks {
04:41:48.813 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
04:41:48.813 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
04:41:48.813 STDOUT [repository] tofu:               + required_check {
04:41:48.813 STDOUT [repository] tofu:                   + context        = "Code Quality"
04:41:48.813 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.813 STDOUT [repository] tofu:                 }
04:41:48.813 STDOUT [repository] tofu:               + required_check {
04:41:48.813 STDOUT [repository] tofu:                   + context        = "Security Scan"
04:41:48.813 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.813 STDOUT [repository] tofu:                 }
04:41:48.813 STDOUT [repository] tofu:               + required_check {
04:41:48.813 STDOUT [repository] tofu:                   + context        = "Tests"
04:41:48.813 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.813 STDOUT [repository] tofu:                 }
04:41:48.813 STDOUT [repository] tofu:             }
04:41:48.813 STDOUT [repository] tofu:         }
04:41:48.813 STDOUT [repository] tofu:     }
04:41:48.813 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["gitops:public-security"] will be created
04:41:48.813 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
04:41:48.813 STDOUT [repository] tofu:       + enforcement = "active"
04:41:48.813 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.813 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.813 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
04:41:48.814 STDOUT [repository] tofu:       + node_id     = (known after apply)
04:41:48.814 STDOUT [repository] tofu:       + repository  = "gitops"
04:41:48.814 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
04:41:48.814 STDOUT [repository] tofu:       + target      = "branch"
04:41:48.814 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.814 STDOUT [repository] tofu:           + actor_id    = 1
04:41:48.814 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
04:41:48.814 STDOUT [repository] tofu:           + bypass_mode = "always"
04:41:48.814 STDOUT [repository] tofu:         }
04:41:48.814 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.814 STDOUT [repository] tofu:           + actor_id    = 5
04:41:48.814 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
04:41:48.814 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
04:41:48.814 STDOUT [repository] tofu:         }
04:41:48.814 STDOUT [repository] tofu:       + conditions {
04:41:48.814 STDOUT [repository] tofu:           + ref_name {
04:41:48.814 STDOUT [repository] tofu:               + exclude = []
04:41:48.814 STDOUT [repository] tofu:               + include = [
04:41:48.814 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
04:41:48.814 STDOUT [repository] tofu:                 ]
04:41:48.814 STDOUT [repository] tofu:             }
04:41:48.814 STDOUT [repository] tofu:         }
04:41:48.814 STDOUT [repository] tofu:       + rules {
04:41:48.814 STDOUT [repository] tofu:           + creation                      = true
04:41:48.814 STDOUT [repository] tofu:           + deletion                      = true
04:41:48.814 STDOUT [repository] tofu:           + non_fast_forward              = true
04:41:48.814 STDOUT [repository] tofu:           + required_linear_history       = true
04:41:48.814 STDOUT [repository] tofu:           + required_signatures           = true
04:41:48.814 STDOUT [repository] tofu:           + update                        = true
04:41:48.814 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
04:41:48.814 STDOUT [repository] tofu:           + branch_name_pattern {
04:41:48.814 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
04:41:48.814 STDOUT [repository] tofu:               + negate   = true
04:41:48.814 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.814 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
04:41:48.814 STDOUT [repository] tofu:             }
04:41:48.814 STDOUT [repository] tofu:           + commit_message_pattern {
04:41:48.814 STDOUT [repository] tofu:               + name     = "Conventional Commits"
04:41:48.814 STDOUT [repository] tofu:               + negate   = false
04:41:48.814 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.814 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
04:41:48.814 STDOUT [repository] tofu:             }
04:41:48.814 STDOUT [repository] tofu:           + merge_queue {
04:41:48.814 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
04:41:48.814 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
04:41:48.814 STDOUT [repository] tofu:               + max_entries_to_build              = 5
04:41:48.814 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
04:41:48.814 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
04:41:48.815 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
04:41:48.815 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
04:41:48.815 STDOUT [repository] tofu:             }
04:41:48.815 STDOUT [repository] tofu:           + pull_request {
04:41:48.815 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
04:41:48.815 STDOUT [repository] tofu:               + require_code_owner_review         = true
04:41:48.815 STDOUT [repository] tofu:               + require_last_push_approval        = true
04:41:48.815 STDOUT [repository] tofu:               + required_approving_review_count   = 2
04:41:48.815 STDOUT [repository] tofu:               + required_review_thread_resolution = true
04:41:48.815 STDOUT [repository] tofu:             }
04:41:48.815 STDOUT [repository] tofu:           + required_code_scanning {
04:41:48.815 STDOUT [repository] tofu:               + required_code_scanning_tool {
04:41:48.815 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
04:41:48.815 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
04:41:48.815 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
04:41:48.815 STDOUT [repository] tofu:                 }
04:41:48.815 STDOUT [repository] tofu:             }
04:41:48.815 STDOUT [repository] tofu:           + required_status_checks {
04:41:48.815 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
04:41:48.815 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
04:41:48.815 STDOUT [repository] tofu:               + required_check {
04:41:48.815 STDOUT [repository] tofu:                   + context        = "Code Quality"
04:41:48.815 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.815 STDOUT [repository] tofu:                 }
04:41:48.815 STDOUT [repository] tofu:               + required_check {
04:41:48.815 STDOUT [repository] tofu:                   + context        = "Security Scan"
04:41:48.815 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.815 STDOUT [repository] tofu:                 }
04:41:48.815 STDOUT [repository] tofu:               + required_check {
04:41:48.815 STDOUT [repository] tofu:                   + context        = "Tests"
04:41:48.815 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.815 STDOUT [repository] tofu:                 }
04:41:48.815 STDOUT [repository] tofu:             }
04:41:48.815 STDOUT [repository] tofu:         }
04:41:48.815 STDOUT [repository] tofu:     }
04:41:48.815 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-live:public-security"] will be created
04:41:48.815 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
04:41:48.815 STDOUT [repository] tofu:       + enforcement = "active"
04:41:48.815 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.815 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.815 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
04:41:48.816 STDOUT [repository] tofu:       + node_id     = (known after apply)
04:41:48.816 STDOUT [repository] tofu:       + repository  = "infra-live"
04:41:48.816 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
04:41:48.816 STDOUT [repository] tofu:       + target      = "branch"
04:41:48.816 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.816 STDOUT [repository] tofu:           + actor_id    = 1
04:41:48.816 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
04:41:48.816 STDOUT [repository] tofu:           + bypass_mode = "always"
04:41:48.816 STDOUT [repository] tofu:         }
04:41:48.816 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.816 STDOUT [repository] tofu:           + actor_id    = 5
04:41:48.816 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
04:41:48.816 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
04:41:48.816 STDOUT [repository] tofu:         }
04:41:48.816 STDOUT [repository] tofu:       + conditions {
04:41:48.816 STDOUT [repository] tofu:           + ref_name {
04:41:48.816 STDOUT [repository] tofu:               + exclude = []
04:41:48.816 STDOUT [repository] tofu:               + include = [
04:41:48.816 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
04:41:48.816 STDOUT [repository] tofu:                 ]
04:41:48.816 STDOUT [repository] tofu:             }
04:41:48.816 STDOUT [repository] tofu:         }
04:41:48.816 STDOUT [repository] tofu:       + rules {
04:41:48.816 STDOUT [repository] tofu:           + creation                      = true
04:41:48.816 STDOUT [repository] tofu:           + deletion                      = true
04:41:48.816 STDOUT [repository] tofu:           + non_fast_forward              = true
04:41:48.816 STDOUT [repository] tofu:           + required_linear_history       = true
04:41:48.816 STDOUT [repository] tofu:           + required_signatures           = true
04:41:48.816 STDOUT [repository] tofu:           + update                        = true
04:41:48.816 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
04:41:48.816 STDOUT [repository] tofu:           + branch_name_pattern {
04:41:48.816 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
04:41:48.816 STDOUT [repository] tofu:               + negate   = true
04:41:48.816 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.816 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
04:41:48.816 STDOUT [repository] tofu:             }
04:41:48.816 STDOUT [repository] tofu:           + commit_message_pattern {
04:41:48.816 STDOUT [repository] tofu:               + name     = "Conventional Commits"
04:41:48.816 STDOUT [repository] tofu:               + negate   = false
04:41:48.816 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.816 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
04:41:48.816 STDOUT [repository] tofu:             }
04:41:48.816 STDOUT [repository] tofu:           + merge_queue {
04:41:48.816 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
04:41:48.816 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
04:41:48.817 STDOUT [repository] tofu:               + max_entries_to_build              = 5
04:41:48.817 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
04:41:48.817 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
04:41:48.817 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
04:41:48.817 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
04:41:48.817 STDOUT [repository] tofu:             }
04:41:48.817 STDOUT [repository] tofu:           + pull_request {
04:41:48.817 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
04:41:48.817 STDOUT [repository] tofu:               + require_code_owner_review         = true
04:41:48.817 STDOUT [repository] tofu:               + require_last_push_approval        = true
04:41:48.817 STDOUT [repository] tofu:               + required_approving_review_count   = 2
04:41:48.817 STDOUT [repository] tofu:               + required_review_thread_resolution = true
04:41:48.817 STDOUT [repository] tofu:             }
04:41:48.817 STDOUT [repository] tofu:           + required_code_scanning {
04:41:48.817 STDOUT [repository] tofu:               + required_code_scanning_tool {
04:41:48.817 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
04:41:48.817 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
04:41:48.817 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
04:41:48.817 STDOUT [repository] tofu:                 }
04:41:48.817 STDOUT [repository] tofu:             }
04:41:48.817 STDOUT [repository] tofu:           + required_status_checks {
04:41:48.817 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
04:41:48.817 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
04:41:48.817 STDOUT [repository] tofu:               + required_check {
04:41:48.817 STDOUT [repository] tofu:                   + context        = "Code Quality"
04:41:48.817 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.817 STDOUT [repository] tofu:                 }
04:41:48.817 STDOUT [repository] tofu:               + required_check {
04:41:48.817 STDOUT [repository] tofu:                   + context        = "Security Scan"
04:41:48.817 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.817 STDOUT [repository] tofu:                 }
04:41:48.817 STDOUT [repository] tofu:               + required_check {
04:41:48.817 STDOUT [repository] tofu:                   + context        = "Tests"
04:41:48.817 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.817 STDOUT [repository] tofu:                 }
04:41:48.817 STDOUT [repository] tofu:             }
04:41:48.817 STDOUT [repository] tofu:         }
04:41:48.817 STDOUT [repository] tofu:     }
04:41:48.817 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-modules:public-security"] will be created
04:41:48.817 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
04:41:48.818 STDOUT [repository] tofu:       + enforcement = "active"
04:41:48.818 STDOUT [repository] tofu:       + etag        = (known after apply)
04:41:48.818 STDOUT [repository] tofu:       + id          = (known after apply)
04:41:48.818 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
04:41:48.818 STDOUT [repository] tofu:       + node_id     = (known after apply)
04:41:48.818 STDOUT [repository] tofu:       + repository  = "infra-modules"
04:41:48.818 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
04:41:48.818 STDOUT [repository] tofu:       + target      = "branch"
04:41:48.818 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.818 STDOUT [repository] tofu:           + actor_id    = 1
04:41:48.818 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
04:41:48.818 STDOUT [repository] tofu:           + bypass_mode = "always"
04:41:48.818 STDOUT [repository] tofu:         }
04:41:48.818 STDOUT [repository] tofu:       + bypass_actors {
04:41:48.818 STDOUT [repository] tofu:           + actor_id    = 5
04:41:48.818 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
04:41:48.818 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
04:41:48.818 STDOUT [repository] tofu:         }
04:41:48.818 STDOUT [repository] tofu:       + conditions {
04:41:48.818 STDOUT [repository] tofu:           + ref_name {
04:41:48.818 STDOUT [repository] tofu:               + exclude = []
04:41:48.818 STDOUT [repository] tofu:               + include = [
04:41:48.818 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
04:41:48.818 STDOUT [repository] tofu:                 ]
04:41:48.818 STDOUT [repository] tofu:             }
04:41:48.818 STDOUT [repository] tofu:         }
04:41:48.818 STDOUT [repository] tofu:       + rules {
04:41:48.818 STDOUT [repository] tofu:           + creation                      = true
04:41:48.819 STDOUT [repository] tofu:           + deletion                      = true
04:41:48.819 STDOUT [repository] tofu:           + non_fast_forward              = true
04:41:48.819 STDOUT [repository] tofu:           + required_linear_history       = true
04:41:48.819 STDOUT [repository] tofu:           + required_signatures           = true
04:41:48.819 STDOUT [repository] tofu:           + update                        = true
04:41:48.819 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
04:41:48.819 STDOUT [repository] tofu:           + branch_name_pattern {
04:41:48.819 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
04:41:48.819 STDOUT [repository] tofu:               + negate   = true
04:41:48.819 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.819 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
04:41:48.819 STDOUT [repository] tofu:             }
04:41:48.819 STDOUT [repository] tofu:           + commit_message_pattern {
04:41:48.819 STDOUT [repository] tofu:               + name     = "Conventional Commits"
04:41:48.819 STDOUT [repository] tofu:               + negate   = false
04:41:48.819 STDOUT [repository] tofu:               + operator = "regex"
04:41:48.819 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
04:41:48.819 STDOUT [repository] tofu:             }
04:41:48.819 STDOUT [repository] tofu:           + merge_queue {
04:41:48.819 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
04:41:48.819 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
04:41:48.819 STDOUT [repository] tofu:               + max_entries_to_build              = 5
04:41:48.819 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
04:41:48.820 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
04:41:48.820 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
04:41:48.820 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
04:41:48.820 STDOUT [repository] tofu:             }
04:41:48.820 STDOUT [repository] tofu:           + pull_request {
04:41:48.820 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
04:41:48.820 STDOUT [repository] tofu:               + require_code_owner_review         = true
04:41:48.820 STDOUT [repository] tofu:               + require_last_push_approval        = true
04:41:48.820 STDOUT [repository] tofu:               + required_approving_review_count   = 2
04:41:48.820 STDOUT [repository] tofu:               + required_review_thread_resolution = true
04:41:48.820 STDOUT [repository] tofu:             }
04:41:48.820 STDOUT [repository] tofu:           + required_code_scanning {
04:41:48.820 STDOUT [repository] tofu:               + required_code_scanning_tool {
04:41:48.820 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
04:41:48.820 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
04:41:48.820 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
04:41:48.820 STDOUT [repository] tofu:                 }
04:41:48.820 STDOUT [repository] tofu:             }
04:41:48.820 STDOUT [repository] tofu:           + required_status_checks {
04:41:48.820 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
04:41:48.820 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
04:41:48.820 STDOUT [repository] tofu:               + required_check {
04:41:48.820 STDOUT [repository] tofu:                   + context        = "Code Quality"
04:41:48.821 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.821 STDOUT [repository] tofu:                 }
04:41:48.821 STDOUT [repository] tofu:               + required_check {
04:41:48.821 STDOUT [repository] tofu:                   + context        = "Security Scan"
04:41:48.821 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.821 STDOUT [repository] tofu:                 }
04:41:48.821 STDOUT [repository] tofu:               + required_check {
04:41:48.821 STDOUT [repository] tofu:                   + context        = "Tests"
04:41:48.821 STDOUT [repository] tofu:                   + integration_id = 0
04:41:48.821 STDOUT [repository] tofu:                 }
04:41:48.821 STDOUT [repository] tofu:             }
04:41:48.821 STDOUT [repository] tofu:         }
04:41:48.821 STDOUT [repository] tofu:     }
04:41:48.821 STDOUT [repository] tofu: Plan: 25 to add, 0 to change, 0 to destroy.
04:41:48.821 STDOUT [repository] tofu: Changes to Outputs:
04:41:48.821 STDOUT [repository] tofu:   + collaborators = {}
04:41:48.821 STDOUT [repository] tofu:   + labels        = {
04:41:48.821 STDOUT [repository] tofu:       + ".github:bug"             = {
04:41:48.821 STDOUT [repository] tofu:           + color       = "d73a4a"
04:41:48.821 STDOUT [repository] tofu:           + description = "Something isn't working"
04:41:48.821 STDOUT [repository] tofu:           + name        = "bug"
04:41:48.821 STDOUT [repository] tofu:           + repository  = ".github"
04:41:48.821 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.821 STDOUT [repository] tofu:         }
04:41:48.821 STDOUT [repository] tofu:       + ".github:stuff"           = {
04:41:48.821 STDOUT [repository] tofu:           + color       = "a2eeef"
04:41:48.821 STDOUT [repository] tofu:           + description = "Stuff"
04:41:48.821 STDOUT [repository] tofu:           + name        = "stuff"
04:41:48.821 STDOUT [repository] tofu:           + repository  = ".github"
04:41:48.822 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.822 STDOUT [repository] tofu:         }
04:41:48.822 STDOUT [repository] tofu:       + "github-management:bug"   = {
04:41:48.822 STDOUT [repository] tofu:           + color       = "d73a4a"
04:41:48.822 STDOUT [repository] tofu:           + description = "Something isn't working"
04:41:48.822 STDOUT [repository] tofu:           + name        = "bug"
04:41:48.822 STDOUT [repository] tofu:           + repository  = "github-management"
04:41:48.822 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.822 STDOUT [repository] tofu:         }
04:41:48.822 STDOUT [repository] tofu:       + "github-management:stuff" = {
04:41:48.822 STDOUT [repository] tofu:           + color       = "a2eeef"
04:41:48.822 STDOUT [repository] tofu:           + description = "Stuff"
04:41:48.822 STDOUT [repository] tofu:           + name        = "stuff"
04:41:48.822 STDOUT [repository] tofu:           + repository  = "github-management"
04:41:48.822 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.822 STDOUT [repository] tofu:         }
04:41:48.822 STDOUT [repository] tofu:       + "gitops:bug"              = {
04:41:48.822 STDOUT [repository] tofu:           + color       = "d73a4a"
04:41:48.822 STDOUT [repository] tofu:           + description = "Something isn't working"
04:41:48.822 STDOUT [repository] tofu:           + name        = "bug"
04:41:48.822 STDOUT [repository] tofu:           + repository  = "gitops"
04:41:48.822 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.822 STDOUT [repository] tofu:         }
04:41:48.822 STDOUT [repository] tofu:       + "gitops:stuff"            = {
04:41:48.822 STDOUT [repository] tofu:           + color       = "a2eeef"
04:41:48.822 STDOUT [repository] tofu:           + description = "Stuff"
04:41:48.822 STDOUT [repository] tofu:           + name        = "stuff"
04:41:48.823 STDOUT [repository] tofu:           + repository  = "gitops"
04:41:48.823 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "infra-live:bug"          = {
04:41:48.823 STDOUT [repository] tofu:           + color       = "d73a4a"
04:41:48.823 STDOUT [repository] tofu:           + description = "Something isn't working"
04:41:48.823 STDOUT [repository] tofu:           + name        = "bug"
04:41:48.823 STDOUT [repository] tofu:           + repository  = "infra-live"
04:41:48.823 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "infra-live:stuff"        = {
04:41:48.823 STDOUT [repository] tofu:           + color       = "a2eeef"
04:41:48.823 STDOUT [repository] tofu:           + description = "Stuff"
04:41:48.823 STDOUT [repository] tofu:           + name        = "stuff"
04:41:48.823 STDOUT [repository] tofu:           + repository  = "infra-live"
04:41:48.823 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "infra-modules:bug"       = {
04:41:48.823 STDOUT [repository] tofu:           + color       = "d73a4a"
04:41:48.823 STDOUT [repository] tofu:           + description = "Something isn't working"
04:41:48.823 STDOUT [repository] tofu:           + name        = "bug"
04:41:48.823 STDOUT [repository] tofu:           + repository  = "infra-modules"
04:41:48.823 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "infra-modules:stuff"     = {
04:41:48.823 STDOUT [repository] tofu:           + color       = "a2eeef"
04:41:48.823 STDOUT [repository] tofu:           + description = "Stuff"
04:41:48.823 STDOUT [repository] tofu:           + name        = "stuff"
04:41:48.823 STDOUT [repository] tofu:           + repository  = "infra-modules"
04:41:48.823 STDOUT [repository] tofu:           + url         = (known after apply)
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:     }
04:41:48.823 STDOUT [repository] tofu:   + milestones    = {
04:41:48.823 STDOUT [repository] tofu:       + ".github:Phase 1: Milestone 1"           = {
04:41:48.823 STDOUT [repository] tofu:           + description = "Milestone 1"
04:41:48.823 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
04:41:48.823 STDOUT [repository] tofu:           + number      = (known after apply)
04:41:48.823 STDOUT [repository] tofu:           + repository  = ".github"
04:41:48.823 STDOUT [repository] tofu:           + state       = "open"
04:41:48.823 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "github-management:Phase 1: Milestone 1" = {
04:41:48.823 STDOUT [repository] tofu:           + description = "Milestone 1"
04:41:48.823 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
04:41:48.823 STDOUT [repository] tofu:           + number      = (known after apply)
04:41:48.823 STDOUT [repository] tofu:           + repository  = "github-management"
04:41:48.823 STDOUT [repository] tofu:           + state       = "open"
04:41:48.823 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "gitops:Phase 1: Milestone 1"            = {
04:41:48.823 STDOUT [repository] tofu:           + description = "Milestone 1"
04:41:48.823 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
04:41:48.823 STDOUT [repository] tofu:           + number      = (known after apply)
04:41:48.823 STDOUT [repository] tofu:           + repository  = "gitops"
04:41:48.823 STDOUT [repository] tofu:           + state       = "open"
04:41:48.823 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
04:41:48.823 STDOUT [repository] tofu:         }
04:41:48.823 STDOUT [repository] tofu:       + "infra-live:Phase 1: Milestone 1"        = {
04:41:48.823 STDOUT [repository] tofu:           + description = "Milestone 1"
04:41:48.824 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
04:41:48.824 STDOUT [repository] tofu:           + number      = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + repository  = "infra-live"
04:41:48.824 STDOUT [repository] tofu:           + state       = "open"
04:41:48.824 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
04:41:48.824 STDOUT [repository] tofu:         }
04:41:48.824 STDOUT [repository] tofu:       + "infra-modules:Phase 1: Milestone 1"     = {
04:41:48.824 STDOUT [repository] tofu:           + description = "Milestone 1"
04:41:48.824 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
04:41:48.824 STDOUT [repository] tofu:           + number      = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + repository  = "infra-modules"
04:41:48.824 STDOUT [repository] tofu:           + state       = "open"
04:41:48.824 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
04:41:48.824 STDOUT [repository] tofu:         }
04:41:48.824 STDOUT [repository] tofu:     }
04:41:48.824 STDOUT [repository] tofu:   + repositories  = {
04:41:48.824 STDOUT [repository] tofu:       + ".github"         = {
04:41:48.824 STDOUT [repository] tofu:           + description    = "Organization-wide GitHub configurations, workflows, and community templates"
04:41:48.824 STDOUT [repository] tofu:           + full_name      = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + html_url       = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + id             = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + name           = ".github"
04:41:48.824 STDOUT [repository] tofu:           + node_id        = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + topics         = [
04:41:48.824 STDOUT [repository] tofu:               + "automation",
04:41:48.824 STDOUT [repository] tofu:               + "community",
04:41:48.824 STDOUT [repository] tofu:               + "github",
04:41:48.824 STDOUT [repository] tofu:               + "templates",
04:41:48.824 STDOUT [repository] tofu:               + "workflows",
04:41:48.824 STDOUT [repository] tofu:             ]
04:41:48.824 STDOUT [repository] tofu:           + visibility     = "public"
04:41:48.824 STDOUT [repository] tofu:         }
04:41:48.824 STDOUT [repository] tofu:       + github-management = {
04:41:48.824 STDOUT [repository] tofu:           + description    = "Infrastructure as Code for GitHub organization, repositories, and security management"
04:41:48.824 STDOUT [repository] tofu:           + full_name      = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + html_url       = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + id             = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + name           = "github-management"
04:41:48.824 STDOUT [repository] tofu:           + node_id        = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
04:41:48.824 STDOUT [repository] tofu:           + topics         = [
04:41:48.824 STDOUT [repository] tofu:               + "automation",
04:41:48.825 STDOUT [repository] tofu:               + "github",
04:41:48.825 STDOUT [repository] tofu:               + "infrastructure",
04:41:48.825 STDOUT [repository] tofu:               + "security",
04:41:48.825 STDOUT [repository] tofu:               + "terraform",
04:41:48.825 STDOUT [repository] tofu:             ]
04:41:48.825 STDOUT [repository] tofu:           + visibility     = "public"
04:41:48.825 STDOUT [repository] tofu:         }
04:41:48.825 STDOUT [repository] tofu:       + gitops            = {
04:41:48.825 STDOUT [repository] tofu:           + description    = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
04:41:48.825 STDOUT [repository] tofu:           + full_name      = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + html_url       = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + id             = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + name           = "gitops"
04:41:48.825 STDOUT [repository] tofu:           + node_id        = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + topics         = [
04:41:48.825 STDOUT [repository] tofu:               + "argocd",
04:41:48.825 STDOUT [repository] tofu:               + "deployments",
04:41:48.825 STDOUT [repository] tofu:               + "gitops",
04:41:48.825 STDOUT [repository] tofu:               + "helm",
04:41:48.825 STDOUT [repository] tofu:               + "kubernetes",
04:41:48.825 STDOUT [repository] tofu:             ]
04:41:48.825 STDOUT [repository] tofu:           + visibility     = "public"
04:41:48.825 STDOUT [repository] tofu:         }
04:41:48.825 STDOUT [repository] tofu:       + infra-live        = {
04:41:48.825 STDOUT [repository] tofu:           + description    = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
04:41:48.825 STDOUT [repository] tofu:           + full_name      = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + html_url       = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
04:41:48.825 STDOUT [repository] tofu:           + id             = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + name           = "infra-live"
04:41:48.826 STDOUT [repository] tofu:           + node_id        = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + topics         = [
04:41:48.826 STDOUT [repository] tofu:               + "environments",
04:41:48.826 STDOUT [repository] tofu:               + "infrastructure",
04:41:48.826 STDOUT [repository] tofu:               + "production",
04:41:48.826 STDOUT [repository] tofu:               + "terraform",
04:41:48.826 STDOUT [repository] tofu:               + "terragrunt",
04:41:48.826 STDOUT [repository] tofu:             ]
04:41:48.826 STDOUT [repository] tofu:           + visibility     = "public"
04:41:48.826 STDOUT [repository] tofu:         }
04:41:48.826 STDOUT [repository] tofu:       + infra-modules     = {
04:41:48.826 STDOUT [repository] tofu:           + description    = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
04:41:48.826 STDOUT [repository] tofu:           + full_name      = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + html_url       = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + id             = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + name           = "infra-modules"
04:41:48.826 STDOUT [repository] tofu:           + node_id        = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
04:41:48.826 STDOUT [repository] tofu:           + topics         = [
04:41:48.826 STDOUT [repository] tofu:               + "cloud",
04:41:48.826 STDOUT [repository] tofu:               + "infrastructure",
04:41:48.826 STDOUT [repository] tofu:               + "kubernetes",
04:41:48.826 STDOUT [repository] tofu:               + "modules",
04:41:48.826 STDOUT [repository] tofu:               + "terraform",
04:41:48.826 STDOUT [repository] tofu:             ]
04:41:48.826 STDOUT [repository] tofu:           + visibility     = "public"
04:41:48.826 STDOUT [repository] tofu:         }
04:41:48.826 STDOUT [repository] tofu:     }
04:41:48.840 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
04:41:48.842 WARN   [organization] Config ./membership/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
04:41:48.892 WARN   [organization] Config ./repository/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
04:41:49.387 STDOUT [organization] tofu: OpenTofu used the selected providers to generate the following execution
04:41:49.387 STDOUT [organization] tofu: plan. Resource actions are indicated with the following symbols:
04:41:49.387 STDOUT [organization] tofu:   + create
04:41:49.387 STDOUT [organization] tofu: OpenTofu will perform the following actions:
04:41:49.387 STDOUT [organization] tofu:   # github_organization_security_manager.security_manager_team will be created
04:41:49.387 STDOUT [organization] tofu:   + resource "github_organization_security_manager" "security_manager_team" {
04:41:49.387 STDOUT [organization] tofu:       + id        = (known after apply)
04:41:49.387 STDOUT [organization] tofu:       + team_slug = "admin"
04:41:49.387 STDOUT [organization] tofu:     }
04:41:49.387 STDOUT [organization] tofu:   # github_organization_settings.main will be created
04:41:49.387 STDOUT [organization] tofu:   + resource "github_organization_settings" "main" {
04:41:49.387 STDOUT [organization] tofu:       + advanced_security_enabled_for_new_repositories               = true
04:41:49.387 STDOUT [organization] tofu:       + billing_email                                                = "your-email@example.com"
04:41:49.387 STDOUT [organization] tofu:       + default_repository_permission                                = "read"
04:41:49.387 STDOUT [organization] tofu:       + dependabot_alerts_enabled_for_new_repositories               = true
04:41:49.388 STDOUT [organization] tofu:       + dependabot_security_updates_enabled_for_new_repositories     = true
04:41:49.388 STDOUT [organization] tofu:       + dependency_graph_enabled_for_new_repositories                = true
04:41:49.388 STDOUT [organization] tofu:       + description                                                  = "Github org Playground stuff"
04:41:49.388 STDOUT [organization] tofu:       + has_organization_projects                                    = true
04:41:49.388 STDOUT [organization] tofu:       + has_repository_projects                                      = false
04:41:49.388 STDOUT [organization] tofu:       + id                                                           = (known after apply)
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_internal_repositories                     = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_pages                                     = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_private_pages                             = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_private_repositories                      = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_public_pages                              = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_public_repositories                       = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_create_repositories                              = false
04:41:49.388 STDOUT [organization] tofu:       + members_can_fork_private_repositories                        = false
04:41:49.389 STDOUT [organization] tofu:       + name                                                         = "Example"
04:41:49.389 STDOUT [organization] tofu:       + secret_scanning_enabled_for_new_repositories                 = true
04:41:49.389 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled_for_new_repositories = true
04:41:49.389 STDOUT [organization] tofu:       + web_commit_signoff_required                                  = false
04:41:49.389 STDOUT [organization] tofu:     }
04:41:49.389 STDOUT [organization] tofu: Plan: 2 to add, 0 to change, 0 to destroy.
04:41:49.389 STDOUT [organization] tofu: Changes to Outputs:
04:41:49.389 STDOUT [organization] tofu:   + organization     = {
04:41:49.389 STDOUT [organization] tofu:       + advanced_security_enabled               = true
04:41:49.389 STDOUT [organization] tofu:       + billing_email                           = "your-email@example.com"
04:41:49.389 STDOUT [organization] tofu:       + blog                                    = null
04:41:49.389 STDOUT [organization] tofu:       + default_repository_permission           = "read"
04:41:49.389 STDOUT [organization] tofu:       + dependabot_alerts_enabled               = true
04:41:49.389 STDOUT [organization] tofu:       + dependabot_security_updates_enabled     = true
04:41:49.389 STDOUT [organization] tofu:       + dependency_graph_enabled                = true
04:41:49.389 STDOUT [organization] tofu:       + description                             = "Github org Playground stuff"
04:41:49.389 STDOUT [organization] tofu:       + email                                   = null
04:41:49.389 STDOUT [organization] tofu:       + has_organization_projects               = true
04:41:49.389 STDOUT [organization] tofu:       + location                                = null
04:41:49.390 STDOUT [organization] tofu:       + name                                    = "Example"
04:41:49.390 STDOUT [organization] tofu:       + secret_scanning_enabled                 = true
04:41:49.390 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled = true
04:41:49.390 STDOUT [organization] tofu:       + web_commit_signoff_required             = false
04:41:49.390 STDOUT [organization] tofu:     }
04:41:49.390 STDOUT [organization] tofu:   + security_manager = {
04:41:49.390 STDOUT [organization] tofu:       + team_slug = "admin"
04:41:49.390 STDOUT [organization] tofu:     }
```

</details>
    
